[Survived] StringLiteral
Frontend/src/app/app-routing.module.ts:18:11
   { path: 'login', component: LoginComponent },
   { path: 'signup', component: SignupComponent },
   {
-    path: 'main',
+    path: "",
     component: MainHeaderComponent,
     canActivate: [AuthGuard],

[Survived] ArrayDeclaration
Frontend/src/app/app-routing.module.ts:20:18
   {
     path: 'main',
     component: MainHeaderComponent,
-    canActivate: [AuthGuard],
+    canActivate: [],
     children: [
       {

[Survived] StringLiteral
Frontend/src/app/app-routing.module.ts:24:21
     children: [
       {
         path: '',
-        redirectTo: 'league',
+        redirectTo: "",
         pathMatch: 'full'
       },

[Survived] ObjectLiteral
Frontend/src/app/app-routing.module.ts:27:7
         redirectTo: 'league',
         pathMatch: 'full'
       },
-      {
-        path: 'league',
-        component: LeagueComponent
-      },
+      {},
       {
         path: 'matches',

[Survived] StringLiteral
Frontend/src/app/app-routing.module.ts:32:15
         component: LeagueComponent
       },
       {
-        path: 'matches',
+        path: "",
         component: MatchesComponent
       },

[Survived] ObjectLiteral
Frontend/src/app/app-routing.module.ts:35:7
         path: 'matches',
         component: MatchesComponent
       },
-      {
-        path: 'matches/:id',
-            component: MatchComponent
-      },
+      {},
       {
         path: 'squad',

[Survived] StringLiteral
Frontend/src/app/app-routing.module.ts:36:15
         component: MatchesComponent
       },
       {
-        path: 'matches/:id',
+        path: "",
             component: MatchComponent
       },

[Survived] ObjectLiteral
Frontend/src/app/app-routing.module.ts:43:7
         path: 'squad',
         component: SquadComponent
       },
-      {
-        path: 'market',
-        component: MarketComponent
-      }
+      {}
     ]
   },

[Survived] ObjectLiteral
Frontend/src/app/app-routing.module.ts:49:3
       }
     ]
   },
-  {
-    path: '',
-    canActivate: [AuthGuard],
-    redirectTo: '/main',
-    pathMatch: 'full'
-  }
+  {}
 ];
 

[Survived] ArrayDeclaration
Frontend/src/app/app-routing.module.ts:51:18
   },
   {
     path: '',
-    canActivate: [AuthGuard],
+    canActivate: [],
     redirectTo: '/main',
     pathMatch: 'full'
