[Survived] ArrayDeclaration
Frontend/src/app/app.component.ts:8:14
 @Component({
   selector: 'app-root',
   templateUrl: './app.component.html',
-  styleUrls: ['./app.component.scss']
+  styleUrls: []
 })
 export class AppComponent {

[Survived] StringLiteral
Frontend/src/app/app.component.ts:13:7
 export class AppComponent {
   constructor(iconRegistry: MatIconRegistry, sanitizer: DomSanitizer) {
     iconRegistry.addSvgIcon(
-      'arrow-back',
+      "",
       sanitizer.bypassSecurityTrustResourceUrl('assets/img/icons/arrow_back-24px.svg')
     );

[Survived] StringLiteral
Frontend/src/app/app.component.ts:18:7
     );
 
     iconRegistry.addSvgIcon(
-      'account-box',
+      "",
       sanitizer.bypassSecurityTrustResourceUrl('assets/img/icons/account_box-24px.svg')
     );

[Survived] StringLiteral
Frontend/src/app/app.component.ts:34:48
 
     iconRegistry.addSvgIcon(
       'keyboard-capslock',
-      sanitizer.bypassSecurityTrustResourceUrl('assets/img/icons/keyboard_capslock-24px.svg')
+      sanitizer.bypassSecurityTrustResourceUrl("")
     );
 

[Survived] StringLiteral
Frontend/src/app/app.component.ts:39:48
 
     iconRegistry.addSvgIcon(
       'monetization-on',
-      sanitizer.bypassSecurityTrustResourceUrl('assets/img/icons/monetization_on-24px.svg')
+      sanitizer.bypassSecurityTrustResourceUrl("")
     );
   }
