[Survived] StringLiteral
src/app/login/login.component.ts:16:13
 }
 
 @Component({
-  selector: 'app-login',
+  selector: "",
   templateUrl: './login.component.html',
   styleUrls: ['./login.component.scss']

[Survived] ArrayDeclaration
src/app/login/login.component.ts:18:14
 @Component({
   selector: 'app-login',
   templateUrl: './login.component.html',
-  styleUrls: ['./login.component.scss']
+  styleUrls: []
 })
 export class LoginComponent implements OnInit {

[Survived] StringLiteral
src/app/login/login.component.ts:23:28
 export class LoginComponent implements OnInit {
 
   loginForm = new FormGroup({
-    email: new FormControl(''),
+    email: new FormControl("Stryker was here!"),
     password: new FormControl(''),
   });

[Survived] StringLiteral
src/app/login/login.component.ts:24:31
 
   loginForm = new FormGroup({
     email: new FormControl(''),
-    password: new FormControl(''),
+    password: new FormControl("Stryker was here!"),
   });
 

[Killed] BooleanLiteral
src/app/login/login.component.ts:27:17
     password: new FormControl(''),
   });
 
-  invalidUser = false;
+  invalidUser = true;
 
   constructor(private router: Router, private loginApiService: LoginApiService) { }

[Killed] BlockStatement
src/app/login/login.component.ts:34:26
   ngOnInit() {
   }
 
-  signin(loginData: any) {
-    this.loginApiService.login(loginData.email, loginData.password).subscribe(
-      () => {
-        this.router.navigate(['/main']);
-      },
-      () => this.invalidUser = true
-    );
-  }
+  signin(loginData: any) {}
 }
 

[Survived] BlockStatement
src/app/login/login.component.ts:36:13
 
   signin(loginData: any) {
     this.loginApiService.login(loginData.email, loginData.password).subscribe(
-      () => {
-        this.router.navigate(['/main']);
-      },
+      () => {},
       () => this.invalidUser = true
     );

[Killed] ArrowFunction
src/app/login/login.component.ts:39:7
       () => {
         this.router.navigate(['/main']);
       },
-      () => this.invalidUser = true
+      () => undefined
     );
   }

[Killed] BooleanLiteral
src/app/login/login.component.ts:39:32
       () => {
         this.router.navigate(['/main']);
       },
-      () => this.invalidUser = true
+      () => this.invalidUser = false
     );
   }
