[Survived] ObjectLiteral
Frontend/src/app/app.module.ts:23:11
 
 
 registerLocaleData(localePt);
-@NgModule({
-  declarations: [
-    AppComponent,
-    LoginComponent,
-    SignupComponent,
-    LeagueComponent,
-    MainHeaderComponent,
-    MatchesComponent,
-    SquadComponent,
-    MatchComponent,
-    MarketComponent
-  ],
-  imports: [
-    BrowserModule,
-    AppRoutingModule,
-    MaterialModule,
-    HttpClientModule,
-  ],
-  providers: [
-    { provide: HTTP_INTERCEPTORS, useClass: JwtInterceptor, multi: true },
-    { provide: HTTP_INTERCEPTORS, useClass: ErrorInterceptor, multi: true }
-  ],
-  bootstrap: [AppComponent]
-})
+@NgModule({})
 export class AppModule { }
 

[Survived] ArrayDeclaration
Frontend/src/app/app.module.ts:24:17
 
 registerLocaleData(localePt);
 @NgModule({
-  declarations: [
-    AppComponent,
-    LoginComponent,
-    SignupComponent,
-    LeagueComponent,
-    MainHeaderComponent,
-    MatchesComponent,
-    SquadComponent,
-    MatchComponent,
-    MarketComponent
-  ],
+  declarations: [],
   imports: [
     BrowserModule,

[Survived] ArrayDeclaration
Frontend/src/app/app.module.ts:41:14
     MaterialModule,
     HttpClientModule,
   ],
-  providers: [
-    { provide: HTTP_INTERCEPTORS, useClass: JwtInterceptor, multi: true },
-    { provide: HTTP_INTERCEPTORS, useClass: ErrorInterceptor, multi: true }
-  ],
+  providers: [],
   bootstrap: [AppComponent]
 })

[Survived] BooleanLiteral
Frontend/src/app/app.module.ts:42:68
     HttpClientModule,
   ],
   providers: [
-    { provide: HTTP_INTERCEPTORS, useClass: JwtInterceptor, multi: true },
+    { provide: HTTP_INTERCEPTORS, useClass: JwtInterceptor, multi: false },
     { provide: HTTP_INTERCEPTORS, useClass: ErrorInterceptor, multi: true }
   ],

[Survived] BooleanLiteral
Frontend/src/app/app.module.ts:43:70
   ],
   providers: [
     { provide: HTTP_INTERCEPTORS, useClass: JwtInterceptor, multi: true },
-    { provide: HTTP_INTERCEPTORS, useClass: ErrorInterceptor, multi: true }
+    { provide: HTTP_INTERCEPTORS, useClass: ErrorInterceptor, multi: false }
   ],
   bootstrap: [AppComponent]
