[Survived] ObjectLiteral
src/app/league/league.component.ts:4:12
 import { Component, OnInit } from '@angular/core';
 import { LeagueApiService, LeagueTeamApi } from '../shared/services/league-api.service';
 
-@Component({
-  selector: 'app-league',
-  templateUrl: './league.component.html',
-  styleUrls: ['./league.component.scss']
-})
+@Component({})
 export class LeagueComponent implements OnInit {
   division: number;

[Survived] ArrayDeclaration
src/app/league/league.component.ts:12:32
 export class LeagueComponent implements OnInit {
   division: number;
 
-  displayedColumns: string[] = ['position', 'teamName', 'points', 'matches', 'won', 'drawn',
-    'lost', 'goalsFor', 'goalsAgainst', 'goalDifference'];
+  displayedColumns: string[] = [];
 
   leagueDataSource: LeagueTeamApi[];

[Survived] StringLiteral
src/app/league/league.component.ts:13:13
   division: number;
 
   displayedColumns: string[] = ['position', 'teamName', 'points', 'matches', 'won', 'drawn',
-    'lost', 'goalsFor', 'goalsAgainst', 'goalDifference'];
+    'lost', "", 'goalsAgainst', 'goalDifference'];
 
   leagueDataSource: LeagueTeamApi[];

[Survived] StringLiteral
src/app/league/league.component.ts:13:5
   division: number;
 
   displayedColumns: string[] = ['position', 'teamName', 'points', 'matches', 'won', 'drawn',
-    'lost', 'goalsFor', 'goalsAgainst', 'goalDifference'];
+    "", 'goalsFor', 'goalsAgainst', 'goalDifference'];
 
   leagueDataSource: LeagueTeamApi[];

[Survived] BlockStatement
src/app/league/league.component.ts:18:20
   leagueDataSource: LeagueTeamApi[];
   constructor(private leagueApiService: LeagueApiService) { }
 
-  ngOnInit(): void {
-    this.getDivisionInformation();
-  }
+  ngOnInit(): void {}
 
   getDivisionInformation(): void {

[Killed] BlockStatement
src/app/league/league.component.ts:22:34
     this.getDivisionInformation();
   }
 
-  getDivisionInformation(): void {
-    this.division = 1;
-    this.leagueApiService.getLeagueByTeam().subscribe((leagueTeamsApi: LeagueTeamApi[]) => {
-
-      this.leagueDataSource = leagueTeamsApi
-        .sort((a, b) => a.position - b.position);
-    });
-  }
+  getDivisionInformation(): void {}
 }
 

[Killed] BlockStatement
src/app/league/league.component.ts:24:92
 
   getDivisionInformation(): void {
     this.division = 1;
-    this.leagueApiService.getLeagueByTeam().subscribe((leagueTeamsApi: LeagueTeamApi[]) => {
-
-      this.leagueDataSource = leagueTeamsApi
-        .sort((a, b) => a.position - b.position);
-    });
+    this.leagueApiService.getLeagueByTeam().subscribe((leagueTeamsApi: LeagueTeamApi[]) => {});
   }
 }

[Killed] ArithmeticOperator
src/app/league/league.component.ts:27:36
     this.leagueApiService.getLeagueByTeam().subscribe((leagueTeamsApi: LeagueTeamApi[]) => {
 
       this.leagueDataSource = leagueTeamsApi
-        .sort((a, b) => a.position - b.position);
+        .sort((a, b) => a.position + b.position);
     });
   }

[Killed] ArrowFunction
src/app/league/league.component.ts:27:15
     this.leagueApiService.getLeagueByTeam().subscribe((leagueTeamsApi: LeagueTeamApi[]) => {
 
       this.leagueDataSource = leagueTeamsApi
-        .sort((a, b) => a.position - b.position);
+        .sort(() => undefined);
     });
   }
