[Survived] BlockStatement
app/shared/guards/auth.guard.ts:13:76
         private authenticationService: LoginApiService
     ) { }
 
-    canActivate(route: ActivatedRouteSnapshot, state: RouterStateSnapshot) {
-        const currentUser = this.authenticationService.currentUserValue;
-        if (currentUser) {
-            // logged in so return true
-            return true;
-        }
-
-        // not logged in so redirect to login page with the return url
-        this.router.navigate(['/login'], { queryParams: { returnUrl: state.url } });
-        return false;
-    }
+    canActivate(route: ActivatedRouteSnapshot, state: RouterStateSnapshot) {}
 }

[Survived] BlockStatement
app/shared/guards/auth.guard.ts:15:26
 
     canActivate(route: ActivatedRouteSnapshot, state: RouterStateSnapshot) {
         const currentUser = this.authenticationService.currentUserValue;
-        if (currentUser) {
-            // logged in so return true
-            return true;
-        }
+        if (currentUser) {}
 
         // not logged in so redirect to login page with the return url

[Survived] ConditionalExpression
app/shared/guards/auth.guard.ts:15:13
 
     canActivate(route: ActivatedRouteSnapshot, state: RouterStateSnapshot) {
         const currentUser = this.authenticationService.currentUserValue;
-        if (currentUser) {
+        if (true) {
             // logged in so return true
             return true;

[Survived] BooleanLiteral
app/shared/guards/auth.guard.ts:17:20
         const currentUser = this.authenticationService.currentUserValue;
         if (currentUser) {
             // logged in so return true
-            return true;
+            return false;
         }
 

[Survived] ArrayDeclaration
app/shared/guards/auth.guard.ts:21:30
         }
 
         // not logged in so redirect to login page with the return url
-        this.router.navigate(['/login'], { queryParams: { returnUrl: state.url } });
+        this.router.navigate([], { queryParams: { returnUrl: state.url } });
         return false;
     }

[Survived] BooleanLiteral
app/shared/guards/auth.guard.ts:22:16
 
         // not logged in so redirect to login page with the return url
         this.router.navigate(['/login'], { queryParams: { returnUrl: state.url } });
-        return false;
+        return true;
     }
 }
