[Survived] ObjectLiteral
src/app/market/market.component.ts:4:12
 import { Component, OnInit } from '@angular/core';
 import { PlayerApi, Position } from '../shared/services/team-api.service';
 
-@Component({
-  selector: 'app-market',
-  templateUrl: './market.component.html',
-  styleUrls: ['./market.component.scss']
-})
+@Component({})
 export class MarketComponent implements OnInit {
 

[Survived] StringLiteral
src/app/market/market.component.ts:5:13
 import { PlayerApi, Position } from '../shared/services/team-api.service';
 
 @Component({
-  selector: 'app-market',
+  selector: "",
   templateUrl: './market.component.html',
   styleUrls: ['./market.component.scss']

[Survived] ArrayDeclaration
src/app/market/market.component.ts:7:14
 @Component({
   selector: 'app-market',
   templateUrl: './market.component.html',
-  styleUrls: ['./market.component.scss']
+  styleUrls: []
 })
 export class MarketComponent implements OnInit {

[Killed] BlockStatement
src/app/market/market.component.ts:19:20
 
   constructor() { }
 
-  ngOnInit(): void {
-    this.availableMoney = 100000;
-    this.playerValue = 1000;
-    this.playerExpiration = new Date();
-    this.playerInformation = {
-      defence: 80,
-      drible: 80,
-      name: 'Artur',
-      id: '123456',
-      overall: 80,
-      pace: 80,
-      pass: 80,
-      physical: 80,
-      position: Position.ATA,
-      shoot: 80,
-      teamId: undefined
-    };
-
-    this.playerPositionDescription = Position[this.playerInformation.position];
-
-  }
+  ngOnInit(): void {}
 
 }

[Survived] StringLiteral
src/app/market/market.component.ts:27:11
       defence: 80,
       drible: 80,
       name: 'Artur',
-      id: '123456',
+      id: "",
       overall: 80,
       pace: 80,
