[Survived] StringLiteral
app/matches/match/match.component.ts:10:13
 }
 
 @Component({
-  selector: 'app-match',
+  selector: "",
   templateUrl: './match.component.html',
   styleUrls: ['./match.component.scss']

[Survived] BlockStatement
app/matches/match/match.component.ts:22:20
 
   constructor(private route: ActivatedRoute, private matchApiService: MatchApiService) { }
 
-  ngOnInit(): void {
-    this.matchId = this.route.snapshot.paramMap.get('id');
-    this.matchApiService.getMatchById(this.matchId).subscribe((matchApi: MatchApi) => {
-      this.finalResult = matchApi.finalResult;
-      const matchEvents: MatchEvents[] = [];
-      matchApi.events.forEach((eventApi: MatchEventApi) => {
-        eventApi.description.sort((a, b) => a.position - b.position);
-        matchEvents.push({
-          descriptions: eventApi.description.map(desc => desc.description)
-        });
-      });
-      this.matchEvents = matchEvents;
-    });
-
-  }
+  ngOnInit(): void {}
 
 

[Survived] StringLiteral
app/matches/match/match.component.ts:23:53
   constructor(private route: ActivatedRoute, private matchApiService: MatchApiService) { }
 
   ngOnInit(): void {
-    this.matchId = this.route.snapshot.paramMap.get('id');
+    this.matchId = this.route.snapshot.paramMap.get("");
     this.matchApiService.getMatchById(this.matchId).subscribe((matchApi: MatchApi) => {
       this.finalResult = matchApi.finalResult;

[Survived] BlockStatement
app/matches/match/match.component.ts:24:87
 
   ngOnInit(): void {
     this.matchId = this.route.snapshot.paramMap.get('id');
-    this.matchApiService.getMatchById(this.matchId).subscribe((matchApi: MatchApi) => {
-      this.finalResult = matchApi.finalResult;
-      const matchEvents: MatchEvents[] = [];
-      matchApi.events.forEach((eventApi: MatchEventApi) => {
-        eventApi.description.sort((a, b) => a.position - b.position);
-        matchEvents.push({
-          descriptions: eventApi.description.map(desc => desc.description)
-        });
-      });
-      this.matchEvents = matchEvents;
-    });
+    this.matchApiService.getMatchById(this.matchId).subscribe((matchApi: MatchApi) => {});
 
   }

[Survived] BlockStatement
app/matches/match/match.component.ts:27:60
     this.matchApiService.getMatchById(this.matchId).subscribe((matchApi: MatchApi) => {
       this.finalResult = matchApi.finalResult;
       const matchEvents: MatchEvents[] = [];
-      matchApi.events.forEach((eventApi: MatchEventApi) => {
-        eventApi.description.sort((a, b) => a.position - b.position);
-        matchEvents.push({
-          descriptions: eventApi.description.map(desc => desc.description)
-        });
-      });
+      matchApi.events.forEach((eventApi: MatchEventApi) => {});
       this.matchEvents = matchEvents;
     });

[Survived] ArrowFunction
app/matches/match/match.component.ts:28:35
       this.finalResult = matchApi.finalResult;
       const matchEvents: MatchEvents[] = [];
       matchApi.events.forEach((eventApi: MatchEventApi) => {
-        eventApi.description.sort((a, b) => a.position - b.position);
+        eventApi.description.sort(() => undefined);
         matchEvents.push({
           descriptions: eventApi.description.map(desc => desc.description)

[Survived] ArithmeticOperator
app/matches/match/match.component.ts:28:56
       this.finalResult = matchApi.finalResult;
       const matchEvents: MatchEvents[] = [];
       matchApi.events.forEach((eventApi: MatchEventApi) => {
-        eventApi.description.sort((a, b) => a.position - b.position);
+        eventApi.description.sort((a, b) => a.position + b.position);
         matchEvents.push({
           descriptions: eventApi.description.map(desc => desc.description)

[Survived] ArrowFunction
app/matches/match/match.component.ts:30:50
       matchApi.events.forEach((eventApi: MatchEventApi) => {
         eventApi.description.sort((a, b) => a.position - b.position);
         matchEvents.push({
-          descriptions: eventApi.description.map(desc => desc.description)
+          descriptions: eventApi.description.map(() => undefined)
         });
       });
