[Killed] BlockStatement
app/shared/services/login-api.service.ts:17:41
   private currentUserSubject: BehaviorSubject<User>;
   public currentUser: Observable<User>;
 
-  constructor(private http: HttpClient) {
-      this.currentUserSubject = new BehaviorSubject<User>(JSON.parse(sessionStorage.getItem('currentUser')));
-      this.currentUser = this.currentUserSubject.asObservable();
-  }
+  constructor(private http: HttpClient) {}
 
   public get currentUserValue(): User {

[Survived] StringLiteral
app/shared/services/login-api.service.ts:18:93
   public currentUser: Observable<User>;
 
   constructor(private http: HttpClient) {
-      this.currentUserSubject = new BehaviorSubject<User>(JSON.parse(sessionStorage.getItem('currentUser')));
+      this.currentUserSubject = new BehaviorSubject<User>(JSON.parse(sessionStorage.getItem("")));
       this.currentUser = this.currentUserSubject.asObservable();
   }

[Survived] ObjectLiteral
app/shared/services/login-api.service.ts:27:65
   }
 
   login(email: string, password: string) {
-      return this.http.post<any>(`${environment.apiUrl}/Login`, { email, password })
+      return this.http.post<any>(`${environment.apiUrl}/Login`, {})
           .pipe(map(user => {
               // store user details and jwt token in local storage to keep user logged in between page refreshes

[Survived] StringLiteral
app/shared/services/login-api.service.ts:30:38
       return this.http.post<any>(`${environment.apiUrl}/Login`, { email, password })
           .pipe(map(user => {
               // store user details and jwt token in local storage to keep user logged in between page refreshes
-              sessionStorage.setItem('currentUser', JSON.stringify(user));
+              sessionStorage.setItem("", JSON.stringify(user));
               this.currentUserSubject.next(user);
               return user;

[Survived] BlockStatement
app/shared/services/login-api.service.ts:36:12
           }));
   }
 
-  logout() {
-      // remove user from local storage to log user out
-      sessionStorage.removeItem('currentUser');
-      this.currentUserSubject.next(null);
-  }
+  logout() {}
 }
 
