[Survived] StringLiteral
src/app/matches/matches.component.ts:14:13
 }
 
 @Component({
-  selector: 'app-matches',
+  selector: "",
   templateUrl: './matches.component.html',
   styleUrls: ['./matches.component.scss']

[Survived] ArrayDeclaration
src/app/matches/matches.component.ts:20:32
 })
 export class MatchesComponent implements OnInit {
   teamId: string;
-  displayedColumns: string[] = ['matchSum'];
+  displayedColumns: string[] = [];
   matchesDataSource: Match[];
 

[Survived] BlockStatement
src/app/matches/matches.component.ts:25:20
 
   constructor(private matchApiService: MatchApiService) { }
 
-  ngOnInit(): void {
-    this.matchApiService.getMatchesByTeamId().subscribe((matchesApi: MatchApi[]) => {
-      const matches: Match[] = [];
-      matchesApi.forEach((matchApi) => {
-        matches.push({
-          awayTeam: matchApi.awayTeamName,
-          homeTeam: matchApi.homeTeamName,
-          finalResult: matchApi.finalResult,
-          id: matchApi.id,
-          awayGoals: matchApi.awayGoals,
-          homeGoals: matchApi.homeGoals
-        });
-      });
-
-      this.matchesDataSource = matches;
-
-    });
-  }
+  ngOnInit(): void {}
 
 }

[Survived] BlockStatement
src/app/matches/matches.component.ts:26:85
   constructor(private matchApiService: MatchApiService) { }
 
   ngOnInit(): void {
-    this.matchApiService.getMatchesByTeamId().subscribe((matchesApi: MatchApi[]) => {
-      const matches: Match[] = [];
-      matchesApi.forEach((matchApi) => {
-        matches.push({
-          awayTeam: matchApi.awayTeamName,
-          homeTeam: matchApi.homeTeamName,
-          finalResult: matchApi.finalResult,
-          id: matchApi.id,
-          awayGoals: matchApi.awayGoals,
-          homeGoals: matchApi.homeGoals
-        });
-      });
-
-      this.matchesDataSource = matches;
-
-    });
+    this.matchApiService.getMatchesByTeamId().subscribe((matchesApi: MatchApi[]) => {});
   }
 

[Survived] BlockStatement
src/app/matches/matches.component.ts:28:40
   ngOnInit(): void {
     this.matchApiService.getMatchesByTeamId().subscribe((matchesApi: MatchApi[]) => {
       const matches: Match[] = [];
-      matchesApi.forEach((matchApi) => {
-        matches.push({
-          awayTeam: matchApi.awayTeamName,
-          homeTeam: matchApi.homeTeamName,
-          finalResult: matchApi.finalResult,
-          id: matchApi.id,
-          awayGoals: matchApi.awayGoals,
-          homeGoals: matchApi.homeGoals
-        });
-      });
+      matchesApi.forEach((matchApi) => {});
 
       this.matchesDataSource = matches;
