[Survived] ObjectLiteral
shared/components/main-header/main-header.component.ts:5:12
 import { Router } from '@angular/router';
 import { LoginApiService } from '../../services/login-api.service';
 
-@Component({
-  selector: 'app-main-header',
-  templateUrl: './main-header.component.html',
-  styleUrls: ['./main-header.component.scss']
-})
+@Component({})
 export class MainHeaderComponent implements OnInit {
 

[Survived] StringLiteral
shared/components/main-header/main-header.component.ts:7:16
 
 @Component({
   selector: 'app-main-header',
-  templateUrl: './main-header.component.html',
+  templateUrl: "",
   styleUrls: ['./main-header.component.scss']
 })

[Survived] BlockStatement
shared/components/main-header/main-header.component.ts:20:12
   ngOnInit(): void {
   }
 
-  logout() {
-    this.loginApiService.logout();
-    this.router.navigate(['/login']);
-  }
+  logout() {}
 
 }
