[Survived] BlockStatement
app/shared/guards/error.interceptor.ts:12:89
 export class ErrorInterceptor implements HttpInterceptor {
     constructor(private authenticationService: LoginApiService) { }
 
-    intercept(request: HttpRequest<any>, next: HttpHandler): Observable<HttpEvent<any>> {
-        return next.handle(request).pipe(catchError(err => {
-            if (err.status === 401) {
-                // auto logout if 401 response returned from api
-                this.authenticationService.logout();
-                location.reload(true);
-            }
-
-            const error = err.error.message || err.statusText;
-            return throwError(error);
-        }));
-    }
+    intercept(request: HttpRequest<any>, next: HttpHandler): Observable<HttpEvent<any>> {}
 }
 

[Survived] BlockStatement
app/shared/guards/error.interceptor.ts:13:60
     constructor(private authenticationService: LoginApiService) { }
 
     intercept(request: HttpRequest<any>, next: HttpHandler): Observable<HttpEvent<any>> {
-        return next.handle(request).pipe(catchError(err => {
-            if (err.status === 401) {
-                // auto logout if 401 response returned from api
-                this.authenticationService.logout();
-                location.reload(true);
-            }
-
-            const error = err.error.message || err.statusText;
-            return throwError(error);
-        }));
+        return next.handle(request).pipe(catchError(err => {}));
     }
 }

[Survived] ConditionalExpression
app/shared/guards/error.interceptor.ts:14:17
 
     intercept(request: HttpRequest<any>, next: HttpHandler): Observable<HttpEvent<any>> {
         return next.handle(request).pipe(catchError(err => {
-            if (err.status === 401) {
+            if (false) {
                 // auto logout if 401 response returned from api
                 this.authenticationService.logout();

[Survived] ConditionalExpression
app/shared/guards/error.interceptor.ts:14:17
 
     intercept(request: HttpRequest<any>, next: HttpHandler): Observable<HttpEvent<any>> {
         return next.handle(request).pipe(catchError(err => {
-            if (err.status === 401) {
+            if (true) {
                 // auto logout if 401 response returned from api
                 this.authenticationService.logout();

[Survived] BooleanLiteral
app/shared/guards/error.interceptor.ts:17:33
             if (err.status === 401) {
                 // auto logout if 401 response returned from api
                 this.authenticationService.logout();
-                location.reload(true);
+                location.reload(false);
             }
 

[Survived] ConditionalExpression
app/shared/guards/error.interceptor.ts:20:27
                 location.reload(true);
             }
 
-            const error = err.error.message || err.statusText;
+            const error = false;
             return throwError(error);
         }));

[Survived] ConditionalExpression
app/shared/guards/error.interceptor.ts:20:27
                 location.reload(true);
             }
 
-            const error = err.error.message || err.statusText;
+            const error = true;
             return throwError(error);
         }));
