[Survived] ArrayDeclaration
app/shared/modules/material.module.ts:27:12
   ],
   providers: [],
   bootstrap: [],
-  exports: [
-    BrowserAnimationsModule,
-    ReactiveFormsModule,
-    MatInputModule,
-    MatButtonModule,
-    MatTableModule,
-    MatCheckboxModule,
-    FormsModule,
-    MatIconModule,
-    MatSnackBarModule,
-  ]
+  exports: []
 })
 export class MaterialModule { }
