[Survived] BlockStatement
app/shared/validators/lower-case.validator.ts:3:62
 import { AbstractControl } from '@angular/forms';
 
-export function lowerCaseValidator(control: AbstractControl) {
-    if (!isLowerCase(control.value)) {
-        return {lowercase: true};
-    }
-    return null;
-}
+export function lowerCaseValidator(control: AbstractControl) {}
 
 export function isLowerCase(value: string) {

[Survived] ConditionalExpression
app/shared/validators/lower-case.validator.ts:4:9
 import { AbstractControl } from '@angular/forms';
 
 export function lowerCaseValidator(control: AbstractControl) {
-    if (!isLowerCase(control.value)) {
+    if (true) {
         return {lowercase: true};
     }

[Survived] BooleanLiteral
app/shared/validators/lower-case.validator.ts:4:9
 import { AbstractControl } from '@angular/forms';
 
 export function lowerCaseValidator(control: AbstractControl) {
-    if (!isLowerCase(control.value)) {
+    if (isLowerCase(control.value)) {
         return {lowercase: true};
     }

[Survived] BooleanLiteral
app/shared/validators/lower-case.validator.ts:5:28
 
 export function lowerCaseValidator(control: AbstractControl) {
     if (!isLowerCase(control.value)) {
-        return {lowercase: true};
+        return {lowercase: false};
     }
     return null;

[Killed] LogicalOperator
app/shared/validators/lower-case.validator.ts:11:25
 }
 
 export function isLowerCase(value: string) {
-    return value.trim() && /^[a-z0-9_\-]+$/.test(value);
+    return value.trim() || /^[a-z0-9_\-]+$/.test(value);
 }
 

[Killed] ConditionalExpression
app/shared/validators/lower-case.validator.ts:11:12
 }
 
 export function isLowerCase(value: string) {
-    return value.trim() && /^[a-z0-9_\-]+$/.test(value);
+    return true;
 }
 
