[Survived] StringLiteral
src/app/signup/signup.component.ts:5:13
 import { FormBuilder } from '@angular/forms';
 
 @Component({
-  selector: 'app-signup',
+  selector: "",
   templateUrl: './signup.component.html',
   styleUrls: ['./signup.component.scss']

[Survived] ArrayDeclaration
src/app/signup/signup.component.ts:7:14
 @Component({
   selector: 'app-signup',
   templateUrl: './signup.component.html',
-  styleUrls: ['./signup.component.scss']
+  styleUrls: []
 })
 export class SignupComponent implements OnInit {

[Survived] BlockStatement
src/app/signup/signup.component.ts:13:49
 
   signUpForm;
 
-  constructor(private formBuilder: FormBuilder) {
-    this.signUpForm = this.formBuilder.group({
-      email: '',
-      password: '',
-      teamName: ''
-    });
-  }
+  constructor(private formBuilder: FormBuilder) {}
 
   ngOnInit() {

[Survived] BlockStatement
src/app/signup/signup.component.ts:24:34
   ngOnInit() {
   }
 
-  onSubmitSignUpForm(formValues) {
-    console.log(formValues);
-  }
+  onSubmitSignUpForm(formValues) {}
 
 }
