[Survived] ObjectLiteral
src/app/squad/squad.component.ts:13:12
   GK, DF, MF, ATA
 }
 
-@Component({
-  selector: 'app-squad',
-  templateUrl: './squad.component.html',
-  styleUrls: ['./squad.component.scss']
-})
+@Component({})
 export class SquadComponent implements OnInit {
 

[Survived] StringLiteral
src/app/squad/squad.component.ts:14:13
 }
 
 @Component({
-  selector: 'app-squad',
+  selector: "",
   templateUrl: './squad.component.html',
   styleUrls: ['./squad.component.scss']

[Survived] BooleanLiteral
src/app/squad/squad.component.ts:21:13
 export class SquadComponent implements OnInit {
 
   teamId: string;
-  starter = false;
+  starter = true;
   teamName: string;
   squadDataSource: Player[] = [];

[Survived] ArrayDeclaration
src/app/squad/squad.component.ts:23:31
   teamId: string;
   starter = false;
   teamName: string;
-  squadDataSource: Player[] = [];
+  squadDataSource: Player[] = ["Stryker was here"];
   displayedColumns = ['starter', 'position', 'name', 'overall', 'pace', 'shoot', 'pass', 'drible', 'defence', 'physical'];
 

[Survived] StringLiteral
src/app/squad/squad.component.ts:24:73
   starter = false;
   teamName: string;
   squadDataSource: Player[] = [];
-  displayedColumns = ['starter', 'position', 'name', 'overall', 'pace', 'shoot', 'pass', 'drible', 'defence', 'physical'];
+  displayedColumns = ['starter', 'position', 'name', 'overall', 'pace', "", 'pass', 'drible', 'defence', 'physical'];
 
   constructor(private teamApiService: TeamApiService, private snackBar: MatSnackBar) { }

[Survived] StringLiteral
src/app/squad/squad.component.ts:24:65
   starter = false;
   teamName: string;
   squadDataSource: Player[] = [];
-  displayedColumns = ['starter', 'position', 'name', 'overall', 'pace', 'shoot', 'pass', 'drible', 'defence', 'physical'];
+  displayedColumns = ['starter', 'position', 'name', 'overall', "", 'shoot', 'pass', 'drible', 'defence', 'physical'];
 
   constructor(private teamApiService: TeamApiService, private snackBar: MatSnackBar) { }

[Survived] BlockStatement
src/app/squad/squad.component.ts:28:20
 
   constructor(private teamApiService: TeamApiService, private snackBar: MatSnackBar) { }
 
-  ngOnInit(): void {
-    this.teamApiService.getTeam().subscribe((team: TeamApi) => {
-      this.teamName = team.name;
-      this.teamId = team.id;
-      const teamPlayers: Player[] = [];
-      team.players.forEach((player: PlayerApi) => {
-        teamPlayers.push({
-          defence: player.defence,
-          drible: player.drible,
-          name: player.name,
-          overall: player.overall,
-          pace: player.pace,
-          pass: player.pass,
-          physical: player.physical,
-          position: player.position,
-          shoot: player.shoot,
-          starter: team.starters.some(p => p.id === player.id),
-          id: player.id,
-          teamId: player.teamId,
-        });
-      });
-      teamPlayers.sort((a, b) => a.position - b.position);
-      this.squadDataSource = teamPlayers;
-    });
-  }
+  ngOnInit(): void {}
 
   getPlayerPosition(positionId: number): string {

[Survived] BlockStatement
src/app/squad/squad.component.ts:29:64
   constructor(private teamApiService: TeamApiService, private snackBar: MatSnackBar) { }
 
   ngOnInit(): void {
-    this.teamApiService.getTeam().subscribe((team: TeamApi) => {
-      this.teamName = team.name;
-      this.teamId = team.id;
-      const teamPlayers: Player[] = [];
-      team.players.forEach((player: PlayerApi) => {
-        teamPlayers.push({
-          defence: player.defence,
-          drible: player.drible,
-          name: player.name,
-          overall: player.overall,
-          pace: player.pace,
-          pass: player.pass,
-          physical: player.physical,
-          position: player.position,
-          shoot: player.shoot,
-          starter: team.starters.some(p => p.id === player.id),
-          id: player.id,
-          teamId: player.teamId,
-        });
-      });
-      teamPlayers.sort((a, b) => a.position - b.position);
-      this.squadDataSource = teamPlayers;
-    });
+    this.teamApiService.getTeam().subscribe((team: TeamApi) => {});
   }
 

[Survived] BlockStatement
src/app/squad/squad.component.ts:33:51
       this.teamName = team.name;
       this.teamId = team.id;
       const teamPlayers: Player[] = [];
-      team.players.forEach((player: PlayerApi) => {
-        teamPlayers.push({
-          defence: player.defence,
-          drible: player.drible,
-          name: player.name,
-          overall: player.overall,
-          pace: player.pace,
-          pass: player.pass,
-          physical: player.physical,
-          position: player.position,
-          shoot: player.shoot,
-          starter: team.starters.some(p => p.id === player.id),
-          id: player.id,
-          teamId: player.teamId,
-        });
-      });
+      team.players.forEach((player: PlayerApi) => {});
       teamPlayers.sort((a, b) => a.position - b.position);
       this.squadDataSource = teamPlayers;

[Survived] ConditionalExpression
src/app/squad/squad.component.ts:44:44
           physical: player.physical,
           position: player.position,
           shoot: player.shoot,
-          starter: team.starters.some(p => p.id === player.id),
+          starter: team.starters.some(p => false),
           id: player.id,
           teamId: player.teamId,

[Survived] ConditionalExpression
src/app/squad/squad.component.ts:44:44
           physical: player.physical,
           position: player.position,
           shoot: player.shoot,
-          starter: team.starters.some(p => p.id === player.id),
+          starter: team.starters.some(p => true),
           id: player.id,
           teamId: player.teamId,

[Survived] ArithmeticOperator
src/app/squad/squad.component.ts:49:45
           teamId: player.teamId,
         });
       });
-      teamPlayers.sort((a, b) => a.position - b.position);
+      teamPlayers.sort((a, b) => a.position + b.position);
       this.squadDataSource = teamPlayers;
     });

[Survived] ArrowFunction
src/app/squad/squad.component.ts:49:24
           teamId: player.teamId,
         });
       });
-      teamPlayers.sort((a, b) => a.position - b.position);
+      teamPlayers.sort(() => undefined);
       this.squadDataSource = teamPlayers;
     });

[Survived] BlockStatement
src/app/squad/squad.component.ts:54:49
     });
   }
 
-  getPlayerPosition(positionId: number): string {
-    return Position[positionId];
-  }
+  getPlayerPosition(positionId: number): string {}
 
   saveStarterTeam() {

[Survived] LogicalOperator
src/app/squad/squad.component.ts:59:81
   }
 
   saveStarterTeam() {
-    if (this.squadDataSource.filter((player) => player.position === Position.GK && player.starter).length !== 1) {
+    if (this.squadDataSource.filter((player) => player.position === Position.GK || player.starter).length !== 1) {
       this.snackBar.open('Chose one Goalkeeper.', undefined, {verticalPosition: 'top', duration: 4000});
     } else if (this.squadDataSource.filter((player) => player.starter).length !== 11) {

[Survived] EqualityOperator
src/app/squad/squad.component.ts:59:107
   }
 
   saveStarterTeam() {
-    if (this.squadDataSource.filter((player) => player.position === Position.GK && player.starter).length !== 1) {
+    if (this.squadDataSource.filter((player) => player.position === Position.GK && player.starter).length === 1) {
       this.snackBar.open('Chose one Goalkeeper.', undefined, {verticalPosition: 'top', duration: 4000});
     } else if (this.squadDataSource.filter((player) => player.starter).length !== 11) {

[Survived] StringLiteral
src/app/squad/squad.component.ts:60:81
 
   saveStarterTeam() {
     if (this.squadDataSource.filter((player) => player.position === Position.GK && player.starter).length !== 1) {
-      this.snackBar.open('Chose one Goalkeeper.', undefined, {verticalPosition: 'top', duration: 4000});
+      this.snackBar.open('Chose one Goalkeeper.', undefined, {verticalPosition: "", duration: 4000});
     } else if (this.squadDataSource.filter((player) => player.starter).length !== 11) {
       this.snackBar.open('Chose only 11 players to start the match.', undefined, {verticalPosition: 'top', duration: 4000});

[Survived] EqualityOperator
src/app/squad/squad.component.ts:61:79
   saveStarterTeam() {
     if (this.squadDataSource.filter((player) => player.position === Position.GK && player.starter).length !== 1) {
       this.snackBar.open('Chose one Goalkeeper.', undefined, {verticalPosition: 'top', duration: 4000});
-    } else if (this.squadDataSource.filter((player) => player.starter).length !== 11) {
+    } else if (this.squadDataSource.filter((player) => player.starter).length === 11) {
       this.snackBar.open('Chose only 11 players to start the match.', undefined, {verticalPosition: 'top', duration: 4000});
     } else if (this.squadDataSource.filter((player) => player.position === Position.DF && player.starter).length === 0) {

[Survived] ConditionalExpression
src/app/squad/squad.component.ts:61:16
   saveStarterTeam() {
     if (this.squadDataSource.filter((player) => player.position === Position.GK && player.starter).length !== 1) {
       this.snackBar.open('Chose one Goalkeeper.', undefined, {verticalPosition: 'top', duration: 4000});
-    } else if (this.squadDataSource.filter((player) => player.starter).length !== 11) {
+    } else if (false) {
       this.snackBar.open('Chose only 11 players to start the match.', undefined, {verticalPosition: 'top', duration: 4000});
     } else if (this.squadDataSource.filter((player) => player.position === Position.DF && player.starter).length === 0) {

[Survived] ConditionalExpression
src/app/squad/squad.component.ts:63:16
       this.snackBar.open('Chose one Goalkeeper.', undefined, {verticalPosition: 'top', duration: 4000});
     } else if (this.squadDataSource.filter((player) => player.starter).length !== 11) {
       this.snackBar.open('Chose only 11 players to start the match.', undefined, {verticalPosition: 'top', duration: 4000});
-    } else if (this.squadDataSource.filter((player) => player.position === Position.DF && player.starter).length === 0) {
+    } else if (true) {
       this.snackBar.open('Chose at least one defender.', undefined, {verticalPosition: 'top', duration: 4000});
     } else if (this.squadDataSource.filter((player) => player.position === Position.MF && player.starter).length === 0) {

[Survived] ArrowFunction
src/app/squad/squad.component.ts:63:44
       this.snackBar.open('Chose one Goalkeeper.', undefined, {verticalPosition: 'top', duration: 4000});
     } else if (this.squadDataSource.filter((player) => player.starter).length !== 11) {
       this.snackBar.open('Chose only 11 players to start the match.', undefined, {verticalPosition: 'top', duration: 4000});
-    } else if (this.squadDataSource.filter((player) => player.position === Position.DF && player.starter).length === 0) {
+    } else if (this.squadDataSource.filter(() => undefined).length === 0) {
       this.snackBar.open('Chose at least one defender.', undefined, {verticalPosition: 'top', duration: 4000});
     } else if (this.squadDataSource.filter((player) => player.position === Position.MF && player.starter).length === 0) {

[Survived] EqualityOperator
src/app/squad/squad.component.ts:65:114
       this.snackBar.open('Chose only 11 players to start the match.', undefined, {verticalPosition: 'top', duration: 4000});
     } else if (this.squadDataSource.filter((player) => player.position === Position.DF && player.starter).length === 0) {
       this.snackBar.open('Chose at least one defender.', undefined, {verticalPosition: 'top', duration: 4000});
-    } else if (this.squadDataSource.filter((player) => player.position === Position.MF && player.starter).length === 0) {
+    } else if (this.squadDataSource.filter((player) => player.position === Position.MF && player.starter).length !== 0) {
       this.snackBar.open('Chose at least one midfielder.', undefined, {verticalPosition: 'top', duration: 4000});
     } else if (this.squadDataSource.filter((player) => player.position === Position.ATA && player.starter).length === 0) {

[Survived] LogicalOperator
src/app/squad/squad.component.ts:65:88
       this.snackBar.open('Chose only 11 players to start the match.', undefined, {verticalPosition: 'top', duration: 4000});
     } else if (this.squadDataSource.filter((player) => player.position === Position.DF && player.starter).length === 0) {
       this.snackBar.open('Chose at least one defender.', undefined, {verticalPosition: 'top', duration: 4000});
-    } else if (this.squadDataSource.filter((player) => player.position === Position.MF && player.starter).length === 0) {
+    } else if (this.squadDataSource.filter((player) => player.position === Position.MF || player.starter).length === 0) {
       this.snackBar.open('Chose at least one midfielder.', undefined, {verticalPosition: 'top', duration: 4000});
     } else if (this.squadDataSource.filter((player) => player.position === Position.ATA && player.starter).length === 0) {

[Survived] ObjectLiteral
src/app/squad/squad.component.ts:66:71
     } else if (this.squadDataSource.filter((player) => player.position === Position.DF && player.starter).length === 0) {
       this.snackBar.open('Chose at least one defender.', undefined, {verticalPosition: 'top', duration: 4000});
     } else if (this.squadDataSource.filter((player) => player.position === Position.MF && player.starter).length === 0) {
-      this.snackBar.open('Chose at least one midfielder.', undefined, {verticalPosition: 'top', duration: 4000});
+      this.snackBar.open('Chose at least one midfielder.', undefined, {});
     } else if (this.squadDataSource.filter((player) => player.position === Position.ATA && player.starter).length === 0) {
       this.snackBar.open('Chose at least one attacker.', undefined, {verticalPosition: 'top', duration: 4000});

[Survived] StringLiteral
src/app/squad/squad.component.ts:66:26
     } else if (this.squadDataSource.filter((player) => player.position === Position.DF && player.starter).length === 0) {
       this.snackBar.open('Chose at least one defender.', undefined, {verticalPosition: 'top', duration: 4000});
     } else if (this.squadDataSource.filter((player) => player.position === Position.MF && player.starter).length === 0) {
-      this.snackBar.open('Chose at least one midfielder.', undefined, {verticalPosition: 'top', duration: 4000});
+      this.snackBar.open("", undefined, {verticalPosition: 'top', duration: 4000});
     } else if (this.squadDataSource.filter((player) => player.position === Position.ATA && player.starter).length === 0) {
       this.snackBar.open('Chose at least one attacker.', undefined, {verticalPosition: 'top', duration: 4000});

[Survived] EqualityOperator
src/app/squad/squad.component.ts:67:115
       this.snackBar.open('Chose at least one defender.', undefined, {verticalPosition: 'top', duration: 4000});
     } else if (this.squadDataSource.filter((player) => player.position === Position.MF && player.starter).length === 0) {
       this.snackBar.open('Chose at least one midfielder.', undefined, {verticalPosition: 'top', duration: 4000});
-    } else if (this.squadDataSource.filter((player) => player.position === Position.ATA && player.starter).length === 0) {
+    } else if (this.squadDataSource.filter((player) => player.position === Position.ATA && player.starter).length !== 0) {
       this.snackBar.open('Chose at least one attacker.', undefined, {verticalPosition: 'top', duration: 4000});
     } else {

[Survived] BlockStatement
src/app/squad/squad.component.ts:67:122
       this.snackBar.open('Chose at least one defender.', undefined, {verticalPosition: 'top', duration: 4000});
     } else if (this.squadDataSource.filter((player) => player.position === Position.MF && player.starter).length === 0) {
       this.snackBar.open('Chose at least one midfielder.', undefined, {verticalPosition: 'top', duration: 4000});
-    } else if (this.squadDataSource.filter((player) => player.position === Position.ATA && player.starter).length === 0) {
-      this.snackBar.open('Chose at least one attacker.', undefined, {verticalPosition: 'top', duration: 4000});
-    } else {
+    } else if (this.squadDataSource.filter((player) => player.position === Position.ATA && player.starter).length === 0) {} else {
       const teamApi: TeamApi = {
         id: this.teamId,

[Survived] ObjectLiteral
src/app/squad/squad.component.ts:68:69
     } else if (this.squadDataSource.filter((player) => player.position === Position.MF && player.starter).length === 0) {
       this.snackBar.open('Chose at least one midfielder.', undefined, {verticalPosition: 'top', duration: 4000});
     } else if (this.squadDataSource.filter((player) => player.position === Position.ATA && player.starter).length === 0) {
-      this.snackBar.open('Chose at least one attacker.', undefined, {verticalPosition: 'top', duration: 4000});
+      this.snackBar.open('Chose at least one attacker.', undefined, {});
     } else {
       const teamApi: TeamApi = {

[Survived] StringLiteral
src/app/squad/squad.component.ts:68:88
     } else if (this.squadDataSource.filter((player) => player.position === Position.MF && player.starter).length === 0) {
       this.snackBar.open('Chose at least one midfielder.', undefined, {verticalPosition: 'top', duration: 4000});
     } else if (this.squadDataSource.filter((player) => player.position === Position.ATA && player.starter).length === 0) {
-      this.snackBar.open('Chose at least one attacker.', undefined, {verticalPosition: 'top', duration: 4000});
+      this.snackBar.open('Chose at least one attacker.', undefined, {verticalPosition: "", duration: 4000});
     } else {
       const teamApi: TeamApi = {

[Survived] BlockStatement
src/app/squad/squad.component.ts:69:12
       this.snackBar.open('Chose at least one midfielder.', undefined, {verticalPosition: 'top', duration: 4000});
     } else if (this.squadDataSource.filter((player) => player.position === Position.ATA && player.starter).length === 0) {
       this.snackBar.open('Chose at least one attacker.', undefined, {verticalPosition: 'top', duration: 4000});
-    } else {
-      const teamApi: TeamApi = {
-        id: this.teamId,
-        name: this.teamName,
-        players: this.squadDataSource as PlayerApi[],
-        starters: this.squadDataSource.filter((player) => player.starter) as PlayerApi[]
-      };
-
-      this.teamApiService.updateTeam(teamApi).subscribe(() => {
-        this.snackBar.open('Squad successfully saved.', undefined, {verticalPosition: 'top', duration: 4000});
-      }, () => {
-        this.snackBar.open('An error occurred', undefined, {verticalPosition: 'top', duration: 4000});
-      });
-    }
+    } else {}
   }
 

[Survived] ObjectLiteral
src/app/squad/squad.component.ts:70:32
     } else if (this.squadDataSource.filter((player) => player.position === Position.ATA && player.starter).length === 0) {
       this.snackBar.open('Chose at least one attacker.', undefined, {verticalPosition: 'top', duration: 4000});
     } else {
-      const teamApi: TeamApi = {
-        id: this.teamId,
-        name: this.teamName,
-        players: this.squadDataSource as PlayerApi[],
-        starters: this.squadDataSource.filter((player) => player.starter) as PlayerApi[]
-      };
+      const teamApi: TeamApi = {};
 
       this.teamApiService.updateTeam(teamApi).subscribe(() => {

[Survived] ArrowFunction
src/app/squad/squad.component.ts:74:47
         id: this.teamId,
         name: this.teamName,
         players: this.squadDataSource as PlayerApi[],
-        starters: this.squadDataSource.filter((player) => player.starter) as PlayerApi[]
+        starters: this.squadDataSource.filter(() => undefined) as PlayerApi[]
       };
 

[Survived] BlockStatement
src/app/squad/squad.component.ts:77:63
         starters: this.squadDataSource.filter((player) => player.starter) as PlayerApi[]
       };
 
-      this.teamApiService.updateTeam(teamApi).subscribe(() => {
-        this.snackBar.open('Squad successfully saved.', undefined, {verticalPosition: 'top', duration: 4000});
-      }, () => {
+      this.teamApiService.updateTeam(teamApi).subscribe(() => {}, () => {
         this.snackBar.open('An error occurred', undefined, {verticalPosition: 'top', duration: 4000});
       });

[Survived] StringLiteral
src/app/squad/squad.component.ts:78:87
       };
 
       this.teamApiService.updateTeam(teamApi).subscribe(() => {
-        this.snackBar.open('Squad successfully saved.', undefined, {verticalPosition: 'top', duration: 4000});
+        this.snackBar.open('Squad successfully saved.', undefined, {verticalPosition: "", duration: 4000});
       }, () => {
         this.snackBar.open('An error occurred', undefined, {verticalPosition: 'top', duration: 4000});

[Survived] ObjectLiteral
src/app/squad/squad.component.ts:78:68
       };
 
       this.teamApiService.updateTeam(teamApi).subscribe(() => {
-        this.snackBar.open('Squad successfully saved.', undefined, {verticalPosition: 'top', duration: 4000});
+        this.snackBar.open('Squad successfully saved.', undefined, {});
       }, () => {
         this.snackBar.open('An error occurred', undefined, {verticalPosition: 'top', duration: 4000});

[Survived] BlockStatement
src/app/squad/squad.component.ts:79:16
 
       this.teamApiService.updateTeam(teamApi).subscribe(() => {
         this.snackBar.open('Squad successfully saved.', undefined, {verticalPosition: 'top', duration: 4000});
-      }, () => {
-        this.snackBar.open('An error occurred', undefined, {verticalPosition: 'top', duration: 4000});
-      });
+      }, () => {});
     }
   }

[Survived] StringLiteral
src/app/squad/squad.component.ts:80:79
       this.teamApiService.updateTeam(teamApi).subscribe(() => {
         this.snackBar.open('Squad successfully saved.', undefined, {verticalPosition: 'top', duration: 4000});
       }, () => {
-        this.snackBar.open('An error occurred', undefined, {verticalPosition: 'top', duration: 4000});
+        this.snackBar.open('An error occurred', undefined, {verticalPosition: "", duration: 4000});
       });
     }
